<?php
define("_act_include",true);
include "../_lib.php";
/*-------------------------------------------------------------------------------------------------
▶ 데이터베이스 연결 */
$db = new MySQL($mysql1);

/*-------------------------------------------------------------------------------------------------
▶ 변수 */
$req['at']         = Request('at');
$req['_referer_']	 = Request('_referer_');
$req['return_url'] = Request('return_url');


if(!$req['_referer_']) $req['_referer_'] = "/";
if(!$_GET['at']) $_GET['at'] = $req['at'];

/*-------------------------------------------------------------------------------------------------
▶ 페이지 호출 */
$include_page = null;
if($_GET['at']){
switch($_GET['at']):


/*******************************************************************************
 *
 * public.action.php
 *
 ******************************************************************************/

	case "bookmarkvisit":  // 우편번호/주소 검색
		$req['mode'] = "Bookmark";
		$include_page = "public.action.php"; break;

/*******************************************************************************
 *
 * End
 *
 ******************************************************************************/
endswitch;
}



if($include_page && file_exists($include_page)) include $include_page;

?>